IDEA Open Model
MatAnchorProperties Properties
Compatible with IDEA StatiCa v 10.1
The MatAnchorProperties type exposes the following members.
Properties
Name | Description
FLS
 Limit force in shear.
FLT
 Limit force in tension
KS
 Shear linear stiffness.
KSN
 Nonlinear stiffness in shear after over loaded FLS
KT
 Tension linear stiffness.
KTN
 Nonlinear stiffness in tension after over loaded FLT
Uls
 Limit deformation in shear for stop solution UCRIT
Ult
 Limit deformation in tension for stop solution UCRIT
Top
See Also
Reference
MatAnchorProperties Class
IdeaRS.OpenModel.Material Namespace